In [1]:
import pandas as pd
import queries_db_script as que
import mysql
import create_db_script as cre
import api_data_retrieve as api
from tqdm import tqdm
pd.set_option('display.max_columns', None)

## Main

There's no need to rum the main function, since our DB is already built according to the main

In [2]:
def main():
    cre.create_all_tables()
    api.insert_all_tables_data()
    cre.create_all_index()

## These are tests of the queries that we created

## In queries that ask for genre, you can use one of the following as you wish:
Drama, Documentary, Comedy, Sci-Fi, Action, Short, Fantasy, Biography, Crime, War, Family, Animation

## In queries that ask for actor names, it doesn't matter if it's upper or lower case

## Query 1

In [3]:
que.query_1("Drama")

       MovieID  Genre                                   Title
0          230  Drama                              Cinderella
1         1431  Drama                      The Unchanging Sea
2         2101  Drama                               Cleopatra
3         2461  Drama  The Life and Death of King Richard III
4         2544  Drama                       Tr�dg�rdsm�staren
...        ...    ...                                     ...
11031  4990652  Drama                            Noc Walpurgi
11032  4991384  Drama                           Interrogation
11033  4991590  Drama                            Interruption
11034  4991660  Drama                           The Black Hen
11035  5005684  Drama                       The New Classmate

[11036 rows x 3 columns]

## Query 2
You can choose years between 1990 and 2015

In [4]:
que.query_2(1995,2005)

,MovieID,Title,Year,IMDbRating,Awards
0,105601,Titanica,1995,6.5,1 nomination.
1,107070,Halbe Welt,1995,6.5,2 wins & 1 nomination.
2,107696,A Dangerous Place,1995,5.2,None
3,108380,Trapped in Space,1995,4.9,None
4,109028,Cold Fever,1995,7.1,3 wins.
...,...,...,...,...,...
9000,2155247,Australian Atomic Confessions,2005,NaN,None
9001,2248926,Un attore contro - Gian Maria Volont�,2005,6.8,None
9002,2650192,Celestial Subway Lines/Salvaging Noise,2005,NaN,None
9003,2780668,What's Going on the Life and Death of Marvin Gaye,2005,7.6,None
9004,3645848,Crossfire: Hate Is Like a Gun,2005,NaN,None

## Query 3
Choose the minimum number of movies by year and genre as you wish

In [5]:
que.query_3(7)

       Genre  Year  Movies Number
0     Action  1937              8
1     Action  1942             15
2     Action  1943             10
3     Action  1947             10
4     Action  1948             12
..       ...   ...            ...
742  Western  1969             19
743  Western  1970             14
744  Western  1971             23
745  Western  1972             15
746  Western  1973             10

[747 rows x 3 columns]

## Query 4
You can use whatever word you think will appear in a plot of the movie

In [6]:
que.query_4("MAGIC")

      IMDBid                           Title
0        420             Alice in Wonderland
1        534                The '?' Motorist
2       3772                      Cinderella
3       7361                      Snow White
4       8891                   The Blue Bird
..       ...                             ...
575  4240654                          Sicc�n
576  4296026                  Avengers Grimm
577  4462082                        Counting
578  4653606  Nate Bargatze: Full Time Magic
579  4789290                 A Kind of Magic

[580 rows x 2 columns]

## Query 5
Choose minimum number of movies above the average rating per director

In [7]:
que.query_5(3)

                                               director  movie_count
0                                  A. Edward Sutherland            5
1                                       A.R. Murugadoss            4
2     Abbas Alibhai Burmawalla, Mastan Alibhai Burma...            5
3                                      Abbas Kiarostami           18
4                                   Abdellatif Kechiche            5
...                                                 ...          ...
1389                                       Zoltan Korda            7
1390                                        �agan Irmak            7
1391                                   �douard Molinaro            6
1392                                 �lex de la Iglesia           10
1393                                  �tienne Chatiliez            4

[1394 rows x 2 columns]

## Query 6
Choose your favorite actor and the relevant years

In [8]:
que.query_6(actor="matt damon", start_year= 2010, end_year= 2014)

   Year  Movies Counter Average Rating per Year
0  2010               2                       8
1  2011               3       6.966666539510091
2  2012               1       6.599999904632568
3  2013               2       6.849999904632568
4  2014               1       6.099999904632568

## Query 7
Choose a year and your desired genre

In [9]:
que.query_7(genre="Comedy",year=2008)

    Year                        Director   Genre  Movies_Counter
0   2009                     Joel Gallen  Comedy               2
1   2009                   Larry Blamire  Comedy               2
2   2009                   Marty Callner  Comedy               2
3   2009                    Priyadarshan  Comedy               2
4   2009                     Tyler Perry  Comedy               2
5   2009                    William Dear  Comedy               2
6   2010                      Gil Junger  Comedy               2
7   2010                    John Moffitt  Comedy               2
8   2010                 Shannon Hartman  Comedy               2
9   2010                      Tim Kirkby  Comedy               2
10  2011            Beth McCarthy-Miller  Comedy               2
11  2011                    Dennis Dugan  Comedy               2
12  2011                     J.B. Rogers  Comedy               2
13  2011                 Jonathan Newman  Comedy               2
14  2011                 Manny Rodriguez  Comedy               2
15  2011                  Michael Damian  Comedy               2
16  2011                   Michael Dowse  Comedy               2
17  2011                Sarik Andreasyan  Comedy               2
18  2011                     Tyler Perry  Comedy               2
19  2012                       Dieudonn�  Comedy               2
20  2012                    Ishai Setton  Comedy               2
21  2012                     Jay Chapman  Comedy               2
22  2012                       Jay Karas  Comedy               3
23  2012                 Manny Rodriguez  Comedy               2
24  2012                  Michael Feifer  Comedy               2
25  2012                Roberto Santucci  Comedy               2
26  2012                     Ryan Polito  Comedy               5
27  2012                Scott L. Montoya  Comedy               4
28  2012                     Tyler Perry  Comedy               2
29  2013                    Greg Mottola  Comedy               2
30  2013  Jason Friedberg, Aaron Seltzer  Comedy               2
31  2013                     Jay Chapman  Comedy               5
32  2013                     Lance Bangs  Comedy               2
33  2013                    Marcus Raboy  Comedy               2
34  2014                       Alex Zamm  Comedy               3
35  2014               Dmitriy Dyachenko  Comedy               2
36  2014                     Jay Chapman  Comedy               7
37  2014                       Jay Karas  Comedy               3
38  2014                     Lance Bangs  Comedy               2
39  2014                      Ron Oliver  Comedy               2
40  2014                     Ryan Polito  Comedy               3
41  2014                       Spike Lee  Comedy               2
42  2015                     Burak Aksak  Comedy               2
43  2015                     Jay Chapman  Comedy               3
44  2015                       Jay Karas  Comedy               2
45  2015                      John Asher  Comedy               2
46  2015                     Lance Bangs  Comedy               3
47  2015                     Ryan Polito  Comedy               2
48  2015                Scott L. Montoya  Comedy               2
49  2015                 Steven Feinartz  Comedy               2
50  2015                   Straw Weisman  Comedy               2
51  2015                William Sullivan  Comedy               2
52  2016                   Ricky Gervais  Comedy               2